[{"model": "home.teammembers", "pk": 1, "fields": {"image": "media/team/RYAN_GRIFFITHS_-_PROPERTY_SALES_CONSULTANT.jpeg", "name": "Ryan griffiths", "role": "Property Investment Consultan", "desc": "Ryan Griffiths is one of our senior Property Investment Consultants. He has been with LPC Invest for nearing on two years now. He houses a great understanding of the property market and uses this to craft high-yielding property portfolios for his clients. Ryan’s sales record is proof of this, alongside the positive client reviews that regularly come his way. Through his work, Ryan always aims to understand his client’s investment goals and through working alongside them, crafts a strategy in order to achieve their end goa", "mobile": "07456 823 143", "email": "ryan.griffiths@lpcinvest.com", "address": "Arrive white, media city UK, m50 2nt."}}, {"model": "home.teammembers", "pk": 2, "fields": {"image": "media/team/NATALIE_DICKINSON_-_PROPERTY_SALES_CONSULTANT_.jpeg", "name": "Natalie dickinson", "role": "Property Sales Consultant", "desc": "Ryan Griffiths is one of our senior Property Investment Consultants. He has been with LPC Invest for nearing on two years now. He houses a great understanding of the property market and uses this to craft high-yielding property portfolios for his clients. Ryan’s sales record is proof of this, alongside the positive client reviews that regularly come his way. Through his work, Ryan always aims to understand his client’s investment goals and through working alongside them, crafts a strategy in order to achieve their end goal.", "mobile": "07462 093 816", "email": "natalie.dickinson@lpcinvest.com", "address": "Arrive white, media city UK, m50 2nt."}}, {"model": "home.teammembers", "pk": 3, "fields": {"image": "media/team/BEN_JOHNSON_-_PROPERTY_SALES_CONSULTANT.jpeg", "name": "Ben johnson", "role": "Property Sales Consultant", "desc": "Ben is an incredibly hard-working and client-focused property investment consultant. His background in customer service allows Ben to tackle any issues thrown his way with professionalism. Ben's passion for the property sector has allowed him to grow his understanding of it and present his clients with the best opportunities suited to them.", "mobile": "07462 081 649", "email": "ben.johnson@lpcinvest.com", "address": "Arrive white, media city UK, m50 2nt."}}, {"model": "home.teammembers", "pk": 4, "fields": {"image": "media/team/Screenshot_2023-01-02_160026.png", "name": "Averil rhead", "role": "Property Sales Consultant", "desc": "Averil is the newest member of the LPC team, joining in October of 2022. She brings 5 years of experience to the table and is passionate about the property sector. North-West property is her speciality, as she has worked alongside this in recent years. Her expert knowledge and constant strive to stay up to date with the world's current climate give her an incredibly valued understanding of the local market.", "mobile": "07456 805930", "email": "averil.rhead@lpcinvest.com", "address": "Arrive white, media city UK, m50 2nt."}}, {"model": "home.teammembers", "pk": 5, "fields": {"image": "media/team/Screenshot_2023-01-02_160026_rhfxBS5.png", "name": "Stephen bryne", "role": "Property Sales Consultant", "desc": "At LPC Invest Steve brings an incredibly unique skill set, which is a detriment to his 16+ years in the industry. As Head of Sales, he ensures the smooth running of the day-to-day at LPC, keeping the team in good spirits no matter what. Steve has developed a reputation for providing first-class service to his clients in the UK and overseas. He is our sales guru.", "mobile": "07456 847 900", "email": "stephen.byrne@lpcinvest.com", "address": "Arrive white, media city UK, m50 2nt."}}, {"model": "home.teammembers", "pk": 6, "fields": {"image": "media/team/JENNIFER_IFTAKAR_-_HEAD_OF_STRATEGIC_PARTNERSHIPS.jpeg", "name": "Jennifer iftakhar", "role": "Head of Strategic Partnerships", "desc": "Jennifer combines her passion for property investment with her exceptional skill set to provide developers with an experience like no other. She has cultivated excellent professional relationships with those she has worked with. Jennifer also headed our recent Reeds Rains partnership, to name but a few of her accomplishments.", "mobile": "07462 964 855", "email": "jennifer.iftakhar@lpcinvest.com", "address": "Arrive white, media city UK, m50 2nt."}}, {"model": "home.teammembers", "pk": 7, "fields": {"image": "media/team/KERRY_PENDER_-_HEAD_OF_OPERATIONS.jpeg", "name": "Kerry pender", "role": "Head Of Operations", "desc": "Kerry is our resident qualified Management Accountant, with her role surrounding the financial sphere, she really is the operations pillar here at LPC Invest. Dedicated, warm, and able to relate to all clients, Kerry's role in property investment is very well-suited and we are incredibly lucky to have her on the team. As our Head of Operations, she is a genuine people person and supports our clients beyond the handing over of their keys.", "mobile": "07456 822 374", "email": "kerry.pender@lpcinvest.com", "address": "Arrive white, media city UK, m50 2nt."}}, {"model": "home.teammembers", "pk": 8, "fields": {"image": "media/team/LEE_CHETTOE_-_MANAGING_DIRECTOR_.jpg", "name": "Lee chettoe", "role": "Managing Director", "desc": "Lee brings a wealth of experience and knowledge to the team here at LPC invest. Having worked within many levels of Property Investment, his commitment and collection of exceptional skills have earned him a strong reputation surrounding his achievements. As a born and bred Mancunian, Lee houses a plethora of knowledge surrounding his home city and its ever-changing nature within the property sector.", "mobile": "07802 748 039", "email": "lee.chettoe@lpcinvest.com", "address": "Arrive white, media city UK, m50 2nt."}}, {"model": "home.teammembers", "pk": 9, "fields": {"image": "media/team/MARIA_VITTORIA_CATAMO_-_HEAD_OF_MARKETING.jpeg", "name": "Maria-vittoria catamo", "role": "Head of Marketing", "desc": "Leading the new marketing department at LPC, Maria brings a wealth of knowledge and experience within her area of expertise. With 12+ years of experience in the digital world, repeated experience indirectly managing teams across numerous projects, she now enjoys crafting unique campaigns that help guide our clients to their perfect investment. Our fluent Italian-speaking Head of Marketing, Maria is a valid credit to the LPC team and has already made such an impact.", "mobile": ".", "email": "maria.vittoriacatamo@lpcinvest.com", "address": "Arrive, White Media City UK, Salford, M50 2NT"}}, {"model": "home.teammembers", "pk": 10, "fields": {"image": "media/team/GEORGIA_EVISON.jpeg", "name": "Georgia evison-castald", "role": "Marketing Executive", "desc": "Georgia is the Marketing Executive at LPC Invest. After graduating from The University of Salford last year, she brought a plethora of new knowledge and skills to the team. Working alongside Maria, they form the team behind all our campaigns and creative content.", "mobile": "0161 713 3883", "email": "georgia.evison@lpcinvest.com", "address": "Arrive, White Media City UK, Salford, M50 2NT"}}]